Repository: overrideEg/upgraded-EWJ
Catalog: ewj-website/src/locale/messages.*.xlf
Languages: ar

source: Read More
ar: اقرأ المزيد

source: Name
ar: الاسم

source: Email
ar: البريد الالكترونى

source: Company
ar: الشركة

source: Job Title
ar: المسمى الوظيفى

source: Phone Number
ar: رقم التليفون

source: Prev
ar: السابق

source: Next
ar: التالى

source: Recent Post
ar: احدث المقالات

source: More...
ar: المزيد

source: Country
ar: البلد

source: What industry is your company in?
ar: ما هي الصناعة التي تعمل بها شركتك؟

source: SUBMIT
ar: إرسال

source: Home
ar: الصفحة الرئيسية

source: Solutions
ar: حلول

source: Solutions For Journey
ar: حلول

source: How To Start
ar: كيف نبدأ ؟

source: Free Assessment
ar: تقييم مجاني

source: Resources
ar: المصادر

source: Solution Parteners
ar: الشركاء

source: Contact US
ar: تواصل معنا

source: <a>English </a>
ar: الانجليزية

source: <a>العربيه </a>
ar: العربية

source: Login to Portal
ar: تسجيل الدخول

source: Home
ar: الصفحة الرئيسية

source: Solutions
ar: حلول

source: Free Assessment
ar: حلول مجانية

source: Resources
ar: مصادر

source: Solution Parteners
ar: شركاء

source: Contact
ar: تواصل معنا

source: Login in to Portal
ar: تسجيل الدخول

source: language <mat-icon>language </mat-icon>
ar: اخر اللغة

source: <a>English </a>
ar: الانجليزية

source: <a>العربيه </a>
ar: العربية

source: CATEGORIES
ar: التصنيفات

source: Home
ar: الصفحة الرئيسية

source: Solutions
ar: الحلول

source: Free Assessment
ar: حلول مجانية

source: Solution Partners
ar: الشركاء

source: Resources
ar: المصادر

source: GET START
ar: ابدأ الان

source: How to start
ar: كيف تبدأ

source: © Copyright 2020 Reserved <a> EWJ </a>
ar: حقوق الملكية خاصة ب EWJ

source: Read More.
ar: اقرأ المزيد

source: العربيه
ar: العربية

source: Solution
ar: حل

source: Welcome to <br/> Employee Wellness Journey
ar: الوقاية لصحة الموظف

source: No one is immune from the multiple stressors being caused by business turbulence. What can leaders do to improve wellbeing stamina? Depending on their sector, turbulence hit organizations very differently. But the single common factor for everyone is that life is infinitely more stressful.
ar: لا أحد محصن من الضغوطات المتعددة التي تسببها الاضطرابات التجارية. ما الذي يمكن أن يفعله القادة لتحسين القدرة على التحمل؟ اعتمادًا على قطاعها ، أصاب الاضطراب المنظمات بشكل مختلف تمامًا. لكن العامل المشترك الوحيد للجميع هو أن الحياة أكثر إرهاقًا بلا حدود.

source: Contact US
ar: تواصل معنا

source: Welcome to <br/> Employee Wellness Journey
ar: الوقاية لصحة الموظف

source: No one is immune from the multiple stressors being caused by business turbulence. What can leaders do to improve wellbeing stamina? Depending on their sector, turbulence hit organizations very differently. But the single common factor for everyone is that life is infinitely more stressful.
ar: لا أحد محصن من الضغوطات المتعددة التي تسببها الاضطرابات التجارية. ما الذي يمكن أن يفعله القادة لتحسين القدرة على التحمل؟ اعتمادًا على قطاعها ، أصاب الاضطراب المنظمات بشكل مختلف تمامًا. لكن العامل المشترك الوحيد للجميع هو أن الحياة أكثر إرهاقًا بلا حدود.

source: Contact US
ar: تواصل معنا

source: Flyers
ar: تجنب

source: Guidelines
ar: القواعد الارشادية

source: Standards
ar: المعايير

source: Are you prepared for the "new normal" ?
ar: هل أنت مستعد لـ "الوضع الطبيعي الجديد"؟ هل أنت مستعد لـ "الوضع الطبيعي الجديد"؟ Are you ready for the "new normal"? هل أنت مستعد ل"الطبيعي الجديد"؟ Are you ready for the "new normal"?

source: We've created a free digital assessment from top research bodies to help organizations understand the impact of COVID-19 on their business and assess their readiness to respond. We have aggregated a list of questions to help assess the preparedness of your organization to this "new normal".
ar: لقد أنشأنا تقييمًا رقميًا مجانيًا من هيئات البحث العليا إلى مساعدة المنظمات على فهم تأثير COVID-19 على أعمالها وتقييم مدى استعدادهم للاستجابة. قمنا بتجميع قائمة من أسئلة للمساعدة في تقييم مدى استعداد منظمتك لذلك "الوضع الطبيعي الجديد".

source: Take Survey
ar: شارك في الاستطلاع

source: contact Us
ar: تواصل معنا

source: safe to go
ar: آمن للذهاب

source: workforce future proof
ar: دليل القوى العاملة في المستقبل

source: employee wellness toolkit
ar: مجموعة أدوات عافية الموظف

source: stress-less workplace
ar: مكان عمل خالي من الإجهاد

source: employee morale
ar: معنويات الموظف

source: Are you prepared for the "new normal" ?
ar: هل أنت مستعد لـ "الوضع الطبيعي الجديد"؟

source: We've created a free digital assessment from top research bodies to help organizations understand the impact of COVID-19 on their business and assess their readiness to respond. We have aggregated a list of questions to help assess the preparedness of your organization to this "new normal".
ar: لقد أنشأنا تقييمًا رقميًا مجانيًا من أفضل الهيئات البحثية لمساعدة المؤسسات على فهم التأثير COVID-19 على أعمالهم وتقييم مدى استعدادهم للاستجابة. قمنا بتجميع قائمة من الأسئلة ل المساعدة في تقييم مدى استعداد مؤسستك لهذا "الوضع الطبيعي الجديد"

source: Take Survey
ar: شارك فى الاستطلاع

source: Country
ar: بلد

source: SUBMIT
ar: ارسال

source: Search
ar: ابحث

source: Categories
ar: الاقسام

source: Free Assessment <mat-icon>keyboard_arrow_down </mat-icon>
ar: تقييم مجانى

source: Resourses <mat-icon>keyboard_arrow_down </mat-icon>
ar: المصادر

source: Solution Parteners <mat-icon>keyboard_arrow_down </mat-icon>
ar: الشركاء

source: Read More
ar: اقرأ المزيد

source: Free Assessment <mat-icon>keyboard_arrow_down </mat-icon>
ar: تقييم مجانى

source: Resourses <mat-icon>keyboard_arrow_down </mat-icon>
ar: المصادر

source: Solution Parteners <mat-icon>keyboard_arrow_down </mat-icon>
ar: الشركاء

source: SUBMIT
ar: ارسال
